import {
  SectionGroup,
  ChecklistSections,
} from "../types";

// Grouped sections for accordions
export const CleaningGroups: SectionGroup[] = [
  {
    group: "Соби",
    sections: ["Општо", "Спална", "Дневна"],
  },
  {
    group: "Кујна",
    sections: ["Кујна", "Трпезарија"],
  },
  {
    group: "Купатило",
    sections: ["Купатило"],
  },
  {
    group: "Останато",
    sections: ["Тераса", "Ходник"],
  },
];

// Cleaning checklist sections
export const CleaningSections: ChecklistSections =
  {
    Општо: [
      "Проветри - отвори врата",
      "Собери постелнина и крпи (спална, кујна, WC)",
      "Собери кеси со ѓубре (кујна и WC)",
      "Истреси прекривачи/кебиња/јастуци (дневна/спална)",
      "Усисај теписи, подови, гарнитура, столице",
      "Избриши прашина од површини",
      "Изџогирај под",
      "Провери да нема заборавени предмети/храна",
      "Исчисти прекидачи за светло и рачки на врата",
      "Провери сите фиоки и висаќи",
    ],
    Спална: [
      "Избриши прашина од ноќни ормари/лампи/ТV",
      "Избриши прашина во гардеробер",
      "Провери TV и далечински",
      "Провери кревет и душек",
      "Провери резервна постелнина под кревет",
    ],
    Дневна: [
      "Избриши и провери TV, далечински и комоду",
      "Избриши прашина од минибар",
      "Избриши прашина од лустер/столна лампа",
      "Провери sofa bed",
      "Наводни цвеќе",
      "Провери WiFi брзина",
      "Провери книги за Македонија (3)",
    ],
    Кујна: [
      "Избриши шпорет и рерна",
      "Испразни и Избриши фрижидер и замрзнувач",
      "Испразни и Избриши машина за кафе",
      "Испразни и Избриши електричен бокал",
      "Испразни тостер од трошки",
      "Избриши микробранова",
      "Провери машина за садови",
      "Провери садови за јадење и готвење",
      "Провери прибор за јадење, чинии, чаши и шољи",
      "Измиј даска за сецкање",
      "Замени крпа за кујна, сунгерче за садови, виледа и крпче за прашина",
      "Дополни чај/кафе/бомбони/вода",
      "Дополни кесе за ѓубре",
    ],
    Купатило: [
      "Исчисти огледало и лавабо",
      "Исчисти туш кабина и туш ручка",
      "Исчисти ВЦ школка и Четка за ВЦ школка",
      "Изџогирај под и плочки",
      "Дополни тоалетна хартија",
      "Дополни течен сапун и шампон",
      "Дополни средство за перење алишта",
      "Дополни средства за чистење и дезинфекција",
      "Замени освеживач за ВЦ школка",
      "Стави нови крпи (капење, лице, ноге) (2 по госта)",
      "Провери фен, машина за прање, бојлер, сушара",
    ],
    Трпезарија: [
      "Пребриши трпезариски астал",
      "Истреси столици од трошки",
      "Намести подлоги за топли садови",
      "Стави вазна на сред маса",
    ],
    Тераса: [
      "Измиј тераса",
      "Пребриши асталче и столици",
    ],
    Ходник: [
      "Пребриши плакар",
      "Пребриши Огледало",
    ],
  };
