import type {
  SectionGroup,
  InventorySections,
} from "./../types";

export const InventoryGroups: SectionGroup[] = [
  {
    group: "Соби",
    sections: [
      "Дневна Инвентура",
      "Спална Инвентура",
    ],
  },
  {
    group: "Кујна и Трпезарија",
    sections: [
      "Кујна Инвентура",
      "Трпезарија Инвентура",
    ],
  },

  {
    group: "Купатило",
    sections: ["Купатило Инвентура"],
  },
  {
    group: "Останато",
    sections: [
      "Ходник Инвентура",
      "Тераса Инвентура",
    ],
  },
];

export const inventorySectionsData: InventorySections =
  {
    "Дневна Инвентура": [
      {
        text: "Столна лампа (1) (IKEA: 30405042)",
        type: "E",
      },
      {
        text: "Перници, бели/тврди, 50x50 см (2)(IKEA: 50550702)",
        type: "E",
      },
      {
        text: "Покривка на гарнитура (2)",
        type: "O",
      },
      {
        text: "Уметничка слика на ѕид (1)",
        type: "O",
      },
      {
        text: "Подлога за маса, воден зумбул, 37 см (1) (IKEA: 40082536)",
        type: "O",
      },
      {
        text: "Computer Mouse (1)",
        type: "O",
      },
      { text: "HDMI кабел (1)", type: "O" },
    ],
    "Кујна Инвентура": [
      {
        text: "Чинии за салата, бели, 20 см (4) (IKEA: 00479704)",
        type: "E",
      },
      {
        text: "Длабоки чинии, бели, 22 см (4) (IKEA: 80479700)",
        type: "E",
      },
      {
        text: "Големи чинии, бели, 26 см (4) (IKEA: 20479694)",
        type: "E",
      },
      {
        text: "Шољи за кафе, бели, 25 cl (4) (IKEA: 80479719)",
        type: "E",
      },
      {
        text: "Чаши за вино, проѕирно стакло, 30 cl (4) (IKEA: 60286903)",
        type: "E",
      },
      {
        text: "Чаши за вода, проѕирно стакло, 35 cl (4) (IKEA: 10505797)",
        type: "E",
      },
      {
        text: "Прибор за јадење, 30 парчиња, од не'рѓосувачки челик (IKEA: 30167507)",
        type: "E",
      },
      {
        text: "Тенџере за готвење со капак (3), тигањ (1)(IKEA: 80580104)",
        type: "E",
      },
      {
        text: "Подметач за тенџере, плута, 19 см (IKEA: 87077700)",
        type: "O",
      },
      {
        text: "Држач за вруќо тенџере, сив, 21x21 см (IKEA: 00476366)",
        type: "O",
      },
      {
        text: "Сад за сол/бибер, проѕирно стакло 8см ( IKEA: 40553211)",
        type: "O",
      },
      {
        text: "Кујнски крпи, бел/зелен/со шари, 45x60 см (4)(IKEA: 60476354)",
        type: "E",
      },
      {
        text: "Кујнски крпи, бел/темно сив/со шари, 45x60 см (8)(IKEA: 20476346)",
        type: "E",
      },
      {
        text: "Полица цедење за садови (1)(IKEA: 80461276)",
        type: "O",
      },
      {
        text: "Жица за матење, тркалезна (1)(IKEA: 10225952)",
        type: "O",
      },
      {
        text: "Организер за прибор за јадење, светла бамбусова, 52x50 см (IKEA: 70433104)",
        type: "O",
      },
      { text: "Ренде", type: "O" },
      { text: "Тостер, црн", type: "O" },
      {
        text: "Бокал за воду на струја",
        type: "O",
      },
      {
        text: "Кафемат KRUPS KP 243B10, 1000W, 15 bar",
        type: "O",
      },
      {
        text: "Здела за капсуле за кафе (Temu)",
        type: "O",
      },
    ],
    "Трпезарија Инвентура": [
      {
        text: "Подлога за маса, темно сива, 38x30см (4) (IKEA: 20569251)",
        type: "O",
      },
      {
        text: "Вазна, проѕирно стакло во боја",
        type: "O",
      },
      {
        text: "Трпезариска маса со 4 столици",
        type: "E",
      },
    ],
    "Спална Инвентура": [
      {
        text: "Офингер (8) (IKEA: 30238543)",
        type: "E",
      },
      {
        text: "Водоотпорен заштитник за душек, 160x200 см (2) (IKEA: 60522129)",
        type: "E",
      },
      {
        text: "Навлака за јорган и 2 навлаки за перници, сива/пругаста, 200x200/50x60см (2) (IKEA: 70423242)",
        type: "E",
      },
      {
        text: "Навлака за јорган и 2 навлаки за перници, бела, 200x200/50x60 см (1) (IKEA: 20377959)",
        type: "E",
      },
      {
        text: "Чаршаф, бела, 160x200 см (3) (IKEA: 30357220)",
        type: "E",
      },
      {
        text: "Јорган за сите сезони, 200x200 см (1+1) (IKEA: 70458585)",
        type: "E",
      },
      {
        text: "Навлака за перница, светло сива, 50x60 см (1) (IKEA: 90482476)",
        type: "O",
      },
      {
        text: "Навлака за перница, бела, 50x60 см (3) (IKEA: 10357301)",
        type: "O",
      },
      {
        text: "Перница, висока, 50x60 см (2) (IKEA: 20460411)",
        type: "E",
      },
      {
        text: "Перница, ниска, на стомак, 50x60 см (2) (IKEA: 50460546)",
        type: "O",
      },
      {
        text: "Столна ламба, пепел/бела (2) (IKEA: 60573538)",
        type: "O",
      },
      {
        text: "Малечка ламба за читање (1)",
        type: "O",
      },
      { text: "Даска за пеглање", type: "O" },
      { text: "Пегла", type: "O" },
      {
        text: "Прекривач/кебе, темно сива, 230x250см (1) (IKEA: 60346447)",
        type: "O",
      },
      { text: "Кебе тенко (1)", type: "O" },
      { text: "Кебе дебело (1)", type: "O" },
      {
        text: "Кревет за деца (Ѓоре)",
        type: "O",
      },
      {
        text: "Навлака за сако (1)",
        type: "O",
      },
    ],
    "Купатило Инвентура": [
      {
        text: "Саксија за цвеќе (IKEA: 40395617)",
        type: "O",
      },
      {
        text: "Канта за отпад (IKEA: 20593736)",
        type: "E",
      },
      {
        text: "Четка за тоалет (IKEA: 10593727)",
        type: "E",
      },
      {
        text: "Држач за тоалетна хартија (IKEA: 40381291)",
        type: "E",
      },
      {
        text: "Крпа за бањање, (6), 70x140 см (IKEA: 80350985)",
        type: "E",
      },
      {
        text: "Крпа за руке, (6), 50x100 см (IKEA: 70350995)",
        type: "E",
      },
      {
        text: "Туш ручка (IKEA: 60342543)",
        type: "O",
      },
      {
        text: "Тепих за бању, тиркизна, 50x80 см (IKEA: 40603169)",
        type: "O",
      },
      {
        text: "Дозатор за сапун (IKEA: 30593726)",
        type: "O",
      },
      {
        text: "Држач за четкице за зуби (IKEA: 50593730)",
        type: "O",
      },
      {
        text: "Самолеплива кука (2) (IKEA: 50567830)",
        type: "O",
      },
      {
        text: "Надворешни полици за крпе, бамбус, 37x37x104см (1)(IKEA: 80549420)",
        type: "O",
      },
      {
        text: "Кутија за прва помош Praxis – JUS 5015",
        type: "E",
      },
      {
        text: "Корпа за фен (STOREAGE)",
        type: "O",
      },
      {
        text: "Фен за косу (MAX HD22IR)",
        type: "O",
      },
      {
        text: "Торба за фен (Temu)",
        type: "O",
      },
      {
        text: "Пластична корпа за веш (Temu)",
        type: "O",
      },
      {
        text: "Гумени папуче (Temu)",
        type: "O",
      },
      {
        text: "Прва помош кутија",
        type: "E",
      },
    ],
    "Ходник Инвентура": [
      {
        text: "Подлога за ципеле 71x35 см(IKEA: 60329711)",
        type: "O",
      },
      {
        text: "Усисувач (MAKS VC 2200SW)",
        type: "E",
      },
      { text: "Кашика за ципеле", type: "O" },
    ],
    "Тераса Инвентура": [
      {
        text: "Столица за седење (2)(IKEA: 90095428)",
        type: "O",
      },
      {
        text: "Асталче за терасу (1)(IKEA: 70095429)",
        type: "O",
      },
    ],
  };
